scrambletools/ESP-AVB-Wireless-AP/c6_firmware/sdkconfig.defaults
# C6 co-processor firmware for ESP-AVB-Wireless-AP. Runs on the
# onboard ESP32-C6 inside the Waveshare ESP32-P4-WiFi6-PoE-ETH (ESP1)
# board. Roles: Wi-Fi SoftAP, FTM responder, SDIO slave forwarding
# bridged frames + AP-side beacon Vendor IE updates from the P4.

CONFIG_IDF_TARGET="esp32c6"

# Wi-Fi tuning for AP role + FTM. Power save is forced off when AVB
# clients are active; default to off here for predictable timing.
CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT=y
CONFIG_ESP_WIFI_FTM_RESPONDER_SUPPORT=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# SDIO slave bring-up — actual pin map applied at runtime in c6_main.c
# once Phase 4 SDIO transport lands.

CONFIG_FREERTOS_HZ=1000
